#因為愛料理的搜尋方式就是用關鍵字比對，所以其實不用窮舉很多，只要打大方向就可以
CRAWL_KEYWORDS = {
    #地區/文化類型
    "chinaese": ["中式","中國","香港","川菜","湘菜","粵菜","東北菜","港式"],
    "taiwanese": ["台式","台灣","家常菜","台菜","客家菜","台灣小吃","古早味","夜市","辦桌","下飯"],
    "japanese": ["日式","日本","和食","居酒屋","定食"],
    "korean": ["韓式","韓國"],
    "thailand": ["泰式","泰國","泰式清爽"],
    "western": ["西式","西餐"],
    "italian": ["義大利麵","義式","義大利"],
    "american": ["美式","美國"],
    "eastern": ["東南亞","東南洋"],
    "foreign":["異國","國際"],

    #餐點類型
    "breakfast": ["早餐","早點"],
    "brunch": ["早午餐"],
    "lunch": ["午餐","中餐"],
    "dinner": ["晚餐","宵夜"],
    "snack": ["點心","下午茶","甜點","零食","輕食"],

    #飲食偏好/健康類型
    "low_calorie": ["低卡","低脂","減肥","瘦身"],
    "low_carb": ["低醣","減醣"],
    "high_protein": ["高蛋白","增肌"],
    "gluten_free": ["無麩質","不含麩質"],
    "vegan": ["全素","純素","全植物","蔬食","奶蛋素","蛋奶素","蛋素","奶素","素食"],

    #不知道要不要加口味

    #特定料理/烹調方式
    "stir_fry": ["熱炒"],
    "pan_fry": ["煎","平底鍋"],
    "fryed": ["炸","脆皮"],
    "baked": ["烤","烘焙","烤箱"],
    "steamed": ["蒸"],
    "stewed": ["燉","燜"],
    "halogen":["滷"],
    "cold_dish": ["涼拌","沙拉"],

    #特殊族群/餐點用途
    "kids": ["兒童餐","親子餐"],
    "festival": ["節日","年菜","過年","過節"],

    #使用者需求
    "quick_easy": ["快速","簡單","入門","新手","低難度"],
    "lazy": ["懶人","一鍋","免洗鍋"]
}

TARGET_SITE = "icook"

"""
CRAWL_KEYWORDS = {
    "breakfast":["早餐"],
    "brunch":["早午餐"],
    "lunch":["午餐"],
    "dinner":["晚餐"],
    "snack":["點心"],
    "dessert":["甜點"],
    "vegetarian":["素食"],
    "boxed_meal":["便當"],
    "soup":["湯"],
    "italian_pasta": ["義大利麵"],
    "ramen": ["拉麵"],
    "sushi": ["壽司"],
    "fried_rice": ["炒飯"],
    "home_style": ["家常菜"],
    "taiwanese": ["台式"],
    "japanese": ["日式"],
    "western": ["西式"],
    "korean": ["韓式"],
    "chinese": ["中式"],
    "american": ["美式"],
    "thailand": ["泰式"],
    #"分類代碼": ["關鍵字1", "關鍵字2", ...]

    # 飲食偏好 / 健康類型
    "low_calorie": ["低卡"],
    "low_carb": ["低醣"],
    "high_protein": ["高蛋白"],
    "gluten_free": ["無麩質"],

    # 特定料理 / 烹調方式
    "baked": ["烤", "烘焙"],
    "fried": ["煎", "炸"],
    "steamed": ["蒸"],
    "salad": ["沙拉"],
    "snack_food": ["小吃"],

    # 特殊族群 / 餐點用途
    "vegan": ["全素", "奶蛋素"],
    "kids": ["兒童餐"],
    "festival": ["節日", "年菜"]
}
"""